CFDEM/CFDEMcoupling/tutorials/cfdemSolverRhoPimple/heatTransferPatil/hw350_u1.71/CFD/constant/liggghtsCommands
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      liggghtsCommands;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

liggghtsCommandModels
(
    runLiggghts
    writeLiggghts
);

//===========================================================================//

writeLiggghtsProps
{
    writeLast       off;
    writeName       "post/restart/liggghts.restartCFDEM";
    overwrite       on;
}

// ************************************************************************* //
